export const imerisioGenikoLykeioData = {
  classA: {
    subjects: {
      core: [
        { name: "Ελληνική Γλώσσα: Αρχαία Ελληνική Γλώσσα και Γραμματεία", hours: 5 },
        { name: "Ελληνική Γλώσσα: Νεοελληνική Γλώσσα και Λογοτεχνία", hours: 4 },
        { name: "Θρησκευτικά", hours: 2 },
        { name: "Ιστορία", hours: 2 },
        { name: "Μαθηματικά: Άλγεβρα", hours: 3 },
        { name: "Μαθηματικά: Γεωμετρία", hours: 2 },
        { name: "Αγγλικά", hours: 3 },
        { name: "2η Ξένη Γλώσσα*", hours: 2 },
        { name: "Φυσικές Επιστήμες: Φυσική", hours: 2 },
        { name: "Φυσικές Επιστήμες: Χημεία", hours: 2 },
        { name: "Φυσικές Επιστήμες: Βιολογία", hours: 2 },
        { name: "Φυσική Αγωγή", hours: 2 },
        { name: "Πολιτική Παιδεία", hours: 2 },
        { name: "Εφαρμογές Πληροφορικής", hours: 2 }
      ]
    }
  },
  classB: {
    subjects: {
      core: [
        { name: "Ελληνική Γλώσσα: Αρχαία Ελληνική Γλώσσα και Γραμματεία", hours: 2 },
        { name: "Ελληνική Γλώσσα: Νεοελληνική Γλώσσα και Λογοτεχνία", hours: 4 },
        { name: "Μαθηματικά: Άλγεβρα", hours: 3 },
        { name: "Μαθηματικά: Γεωμετρία", hours: 2 },
        { name: "Φυσικές Επιστήμες: Φυσική", hours: 2 },
        { name: "Φυσικές Επιστήμες: Χημεία", hours: 2 },
        { name: "Φυσικές Επιστήμες: Βιολογία", hours: 2 },
        { name: "Εισαγωγή στις Αρχές της Επιστήμης των Η/Υ", hours: 2 },
        { name: "Ιστορία", hours: 2 },
        { name: "Φιλοσοφία", hours: 2 },
        { name: "Θρησκευτικά", hours: 2 },
        { name: "Αγγλικά", hours: 2 },
        { name: "2η Ξένη Γλώσσα*", hours: 1 },
        { name: "Φυσική Αγωγή", hours: 2 }
      ],
      humanities: [
        { name: "Αρχαία Ελληνική Γλώσσα και Γραμματεία", hours: 3 },
        { name: "Λατινικά", hours: 2 }
      ],
      science: [
        { name: "Φυσική", hours: 2 },
        { name: "Μαθηματικά", hours: 3 }
      ]
    }
  },
  classC: {
    subjects: {
      core: [
        { name: "Θρησκευτικά", hours: 1 },
        { name: "Νεοελληνική Γλώσσα και Λογοτεχνία", hours: 6 },
        { name: "Ιστορία Γενικής Παιδείας* / Μαθηματικά Γενικής Παιδείας*", hours: 2 },
        { name: "Αγγλικά", hours: 2 },
        { name: "Φυσική Αγωγή", hours: 3 }
      ],
      humanities: [
        { name: "Αρχαία Ελληνικά", hours: 6 },
        { name: "Ιστορία", hours: 6 },
        { name: "Λατινικά", hours: 6 }
      ],
      science: [
        { name: "Μαθηματικά* / Βιολογία*", hours: 6 },
        { name: "Φυσική", hours: 6 },
        { name: "Χημεία", hours: 6 }
      ],
      economics: [
        { name: "Μαθηματικά", hours: 6 },
        { name: "Πληροφορική", hours: 6 },
        { name: "Οικονομία", hours: 6 }
      ]
    }
  }
};


export const esperinoGenikoLykeioData = {
  classA: {
    subjects: {
      core: [
        { name: "Ελληνική Γλώσσα: Αρχαία Ελληνική Γλώσσα και Γραμματεία", hours: 2 },
        { name: "Ελληνική Γλώσσα: Νεοελληνική Γλώσσα και Λογοτεχνία", hours: 4 },
        { name: "Θρησκευτικά", hours: 1 },
        { name: "Ιστορία", hours: 2 },
        { name: "Μαθηματικά: Άλγεβρα", hours: 2 },
        { name: "Μαθηματικά: Γεωμετρία", hours: 2 },
        { name: "Αγγλικά", hours: 2 },
        { name: "Φυσικές Επιστήμες: Φυσική", hours: 2 },
        { name: "Φυσικές Επιστήμες: Χημεία", hours: 2 },
        { name: "Φυσικές Επιστήμες: Βιολογία", hours: 2 },
        { name: "Φυσική Αγωγή", hours: 1 },
        { name: "Πολιτική Παιδεία", hours: 1 },
        { name: "Εφαρμογές Πληροφορικής", hours: 2 }
      ]
    }
  },
  classB: {
    subjects: {
      core: [
        { name: "Ελληνική Γλώσσα: Αρχαία Ελληνική Γλώσσα και Γραμματεία", hours: 1 },
        { name: "Ελληνική Γλώσσα: Νεοελληνική Γλώσσα και Λογοτεχνία", hours: 4 },
        { name: "Μαθηματικά: Άλγεβρα", hours: 3 },
        { name: "Μαθηματικά: Γεωμετρία", hours: 1 },
        { name: "Φυσικές Επιστήμες: Φυσική", hours: 2 },
        { name: "Φυσικές Επιστήμες: Χημεία*", hours: 1 },
        { name: "Φυσικές Επιστήμες: Βιολογία*", hours: 2 },
        { name: "Ιστορία", hours: 2 },
        { name: "Θρησκευτικά", hours: 1 },
        { name: "Αγγλικά", hours: 2 },
        { name: "Φυσική Αγωγή", hours: 1 }
      ],
      humanities: [
        { name: "Αρχαία Ελληνική Γλώσσα και Γραμματεία", hours: 3 },
        { name: "Λατινικά", hours: 2 }
      ],
      science: [
        { name: "Φυσική", hours: 2 },
        { name: "Μαθηματικά", hours: 3 }
      ]
    }
  },
  classC: {
    subjects: {
      core: [
        { name: "Θρησκευτικά", hours: 1 },
        { name: "Νεοελληνική Γλώσσα και Λογοτεχνία", hours: 5 },
        { name: "Ιστορία Γενικής Παιδείας* / Μαθηματικά Γενικής Παιδείας*", hours: 1 },
      ],
      humanities: [
        { name: "Αρχαία Ελληνικά", hours: 6 },
        { name: "Ιστορία", hours: 6 },
        { name: "Λατινικά", hours: 6 }
      ],
      science: [
        { name: "Μαθηματικά* / Βιολογία*", hours: 6 },
        { name: "Φυσική", hours: 6 },
        { name: "Χημεία", hours: 6 }
      ],
      economics: [
        { name: "Μαθηματικά", hours: 6 },
        { name: "Πληροφορική", hours: 6 },
        { name: "Οικονομία", hours: 6 }
      ]
    }
  }
};


export const kallitexnikoLykeioData = {
  classA: {
    subjects: {
      core: [
        { name: "Ελληνική Γλώσσα: Αρχαία Ελληνική Γλώσσα και Γραμματεία", hours: 5 },
        { name: "Ελληνική Γλώσσα: Νεοελληνική Γλώσσα και Λογοτεχνία", hours: 4 },
        { name: "Θρησκευτικά", hours: 1 },
        { name: "Ιστορία", hours: 2 },
        { name: "Μαθηματικά: Άλγεβρα", hours: 3 },
        { name: "Μαθηματικά: Γεωμετρία", hours: 2 },
        { name: "Αγγλικά", hours: 2 },
        { name: "Φυσικές Επιστήμες: Φυσική", hours: 2 },
        { name: "Φυσικές Επιστήμες: Χημεία", hours: 2 },
        { name: "Φυσικές Επιστήμες: Βιολογία", hours: 2 },
        { name: "Φυσική Αγωγή", hours: 1 },
        { name: "Πολιτική Παιδεία", hours: 2 },
        { name: "Εφαρμογές Πληροφορικής", hours: 2 }
      ],
      art: [
        { name: "Ζωγραφική", hours: 3 },
        { name: "Γλυπτική", hours: 3 },
        { name: "Χαρακτική", hours: 2 },
        { name: "Φωτογραφία", hours: 1 },
        { name: "Ιστορία Τέχνης", hours: 1 },
      ],
      theatre: [
        { name: "Κινησιολογία", hours: 1 },
        { name: "Υποκριτική", hours: 3 },
        { name: "Φωνητική - Ορθοφωνία", hours: 1 },
        { name: "Δραματοποίηση κειμένου", hours: 2 },
        { name: "Ιστορία Κινηματογράφου", hours: 1 },
        { name: "Αισθητική Κινηματογράφου - Βασικές Αρχές Σκηνοθεσίας Κινηματογράφου", hours: 2 },
      ],
      dance: [
        { name: "Κλασικός Χορός", hours: 4 },
        { name: "Τεχνικές Σύγχρονου χορού", hours: 4 },
        { name: "Ρυθμός - Μετρική - Κίνηση", hours: 2 },
      ],
    }
  },
  classB: {
    subjects: {
      core: [
        { name: "Ελληνική Γλώσσα: Αρχαία Ελληνική Γλώσσα και Γραμματεία", hours: 2 },
        { name: "Ελληνική Γλώσσα: Νεοελληνική Γλώσσα και Λογοτεχνία", hours: 4 },
        { name: "Μαθηματικά: Άλγεβρα", hours: 3 },
        { name: "Μαθηματικά: Γεωμετρία", hours: 2 },
        { name: "Φυσικές Επιστήμες: Φυσική", hours: 2 },
        { name: "Φυσικές Επιστήμες: Χημεία", hours: 2 },
        { name: "Φυσικές Επιστήμες: Βιολογία", hours: 2 },
        { name: "Εισαγωγή στις Αρχές της Επιστήμης των Η/Υ", hours: 2 },
        { name: "Ιστορία", hours: 2 },
        { name: "Φιλοσοφία", hours: 1 },
        { name: "Θρησκευτικά", hours: 1 },
        { name: "Αγγλικά", hours: 2 },
        { name: "Φυσική Αγωγή", hours: 1 }
      ],
      humanities: [
        { name: "Αρχαία Ελληνική Γλώσσα και Γραμματεία", hours: 3 },
        { name: "Λατινικά", hours: 2 }
      ],
      science: [
        { name: "Φυσική", hours: 2 },
        { name: "Μαθηματικά", hours: 3 }
      ],
      art: [
        { name: "Ζωγραφική", hours: 4 },
        { name: "Γλυπτική", hours: 2 },
        { name: "Χαρακτική", hours: 1 },
        { name: "Πολυμέσα", hours: 1 },
        { name: "Ιστορία Τέχνης", hours: 1 },
      ],
      theatre: [
        { name: "Κινησιολογία - Σωματική Έκφραση", hours: 1 },
        { name: "Υποκριτική", hours: 2 },
        { name: "Στοιχεία Σκηνοθεσίας Θεάτρου", hours: 2 },
        { name: "Φωνητική - Τραγούδι", hours: 1 },
        { name: "Ιστορία Θεάτρου - Ιστορία Κινηματογράφου", hours: 1 },
        { name: "Αισθητική Κινηματογράφου - Βασικές Αρχές Σκηνοθεσίας Κινηματογράφου", hours: 2 },
      ],
      dance: [
        { name: "Κλασικός Χορός", hours: 3 },
        { name: "Τεχνικές Σύγχρονου χορού", hours: 4 },
        { name: "Ρυθμός - Μετρική - Κίνηση", hours: 1 },
        { name: "Ιστορία Τέχνης", hours: 1 },
      ],
    }
  },
  classC: {
    subjects: {
      core: [
        { name: "Θρησκευτικά", hours: 1 },
        { name: "Νεοελληνική Γλώσσα και Λογοτεχνία", hours: 6 },
        { name: "Ιστορία Γενικής Παιδείας* / Μαθηματικά Γενικής Παιδείας*", hours: 2 },
        { name: "Αγγλικά", hours: 1 },
        { name: "Φυσική Αγωγή", hours: 1 }
      ],
      humanities: [
        { name: "Αρχαία Ελληνικά", hours: 6 },
        { name: "Ιστορία", hours: 6 },
        { name: "Λατινικά", hours: 6 }
      ],
      science: [
        { name: "Μαθηματικά* / Βιολογία*", hours: 6 },
        { name: "Φυσική", hours: 6 },
        { name: "Χημεία", hours: 6 }
      ],
      economics: [
        { name: "Μαθηματικά", hours: 6 },
        { name: "Πληροφορική", hours: 6 },
        { name: "Οικονομία", hours: 6 }
      ],
      art: [
        { name: "Ζωγραφική", hours: 3 },
        { name: "Γλυπτική", hours: 2 },
        { name: "Χαρακτική", hours: 2 },
        { name: "Βιομηχανικό Σχέδιο", hours: 1 },
        { name: "Εργαστήρια Πολυμέσα", hours: 1 },
      ],
      theatre: [
        { name: "Κινησιολογία - Σωματική Έκφραση", hours: 1 },
        { name: "Υποκριτική", hours: 2 },
        { name: "Στοιχεία Σκηνοθεσίας Θεάτρου", hours: 2 },
        { name: "Ιστορία Θεάτρου", hours: 1 },
        { name: "Φωνητική - Τραγούδι", hours: 1 },
        { name: "Αισθητική Κινηματογράφου - Βασικές Αρχές Σκηνοθεσίας Κινηματογράφου", hours: 2 },
      ],
      dance: [
        { name: "Κλασικός Χορός", hours: 3 },
        { name: "Τεχνικές Σύγχρονου χορού", hours: 3 },
        { name: "Κινησιολογία", hours: 3 },
      ],
      optional: [
        { name: "Ελεύθερο Σχέδιο", hours: 2 },
        { name: "Γραμμικό Σχέδιο", hours: 2 },
        { name: "Μέσα Μαζικής Επικοινωνίας (ΜΜΕ)", hours: 2 },
        { name: "Χορός για την Κάμερα (Video Dance)", hours: 2 },
        { name: "Κεραμική", hours: 2 },
        { name: "Εργαστήρι Μάσκας και Θεατρικών εξαρτημάτων", hours: 2 },
        { name: "Σκηνογραφία - Ενδυματολογία", hours: 2 },
        { name: "Ντοκιμαντέρ", hours: 2 },
        { name: "Θεωρία Τέχνης - Στοιχεία Αισθητικής", hours: 2 },
        { name: "Φωτισμός θεάτρου", hours: 2 },
        { name: "Δημιουργική γραφή", hours: 2 },
        { name: "Κινηματογραφική Τεχνολογία - Φωτογραφία Κινηματογράφου", hours: 2 }
      ]
    }
  }
};


export const mousikoLykeioData = {
  classA: {
    subjects: {
      core: [
        { name: "Ελληνική Γλώσσα: Αρχαία Ελληνική Γλώσσα και Γραμματεία", hours: 5 },
        { name: "Ελληνική Γλώσσα: Νεοελληνική Γλώσσα και Λογοτεχνία", hours: 4 },
        { name: "Θρησκευτικά", hours: 1 },
        { name: "Ιστορία", hours: 2 },
        { name: "Μαθηματικά: Άλγεβρα", hours: 3 },
        { name: "Μαθηματικά: Γεωμετρία", hours: 2 },
        { name: "Αγγλικά", hours: 2 },
        { name: "Φυσικές Επιστήμες: Φυσική", hours: 2 },
        { name: "Φυσικές Επιστήμες: Χημεία", hours: 2 },
        { name: "Φυσικές Επιστήμες: Βιολογία", hours: 2 },
        { name: "Φυσική Αγωγή", hours: 1 },
        { name: "Πολιτική Παιδεία", hours: 2 },
        { name: "Εφαρμογές Πληροφορικής", hours: 1 }
      ],
      music_core: [
        { name: "Αρμονία", hours: 2 },
        { name: "Ανάπτυξη Ακουστικών Ικανοτήτων*", hours: 1 },
        { name: "Ελληνική Παραδοσιακή Μουσική", hours: 2 },
        { name: "Ιστορία της Μουσικής", hours: 1 },
        { name: "Υποχρεωτικό Ατομικό Μουσικό Όργανο: Πιάνο", hours: 1 },
        { name: "Ατομικό Όργανο Επιλογής", hours: 1 },
        { name: "Μουσικό Σύνολο (Οργανοχρησίας ή άλλου είδους)", hours: 2 },
        { name: "Μουσικό Σύνολο (Μουσικής Έκφρασης και Δημιουργίας)", hours: 2 },
      ],
      music_optional: [
        { name: "Οργανολογία Ελληνικών Παραδοσιακών Οργάνων*", hours: 1 },
        { name: "Οργανολογία Μουσικών Οργάνων Συμφωνικής Ορχήστρας*", hours: 1 },
        { name: "Στοιχεία Αντίστιξης", hours: 1 },
        { name: "Εφαρμογές Πληροφορικής στη Μουσική", hours: 1 },
        { name: "Επεξεργασία Μουσικού Κειμένου με Η/Υ", hours: 1 },
        { name: "Στοιχειώδεις αρχές ηχοληψίας Ι", hours: 1 },
      ],
    },
  },
  classB: {
    subjects: {
      core: [
        { name: "Ελληνική Γλώσσα: Αρχαία Ελληνική Γλώσσα και Γραμματεία", hours: 2 },
        { name: "Ελληνική Γλώσσα: Νεοελληνική Γλώσσα και Λογοτεχνία", hours: 4 },
        { name: "Μαθηματικά: Άλγεβρα", hours: 3 },
        { name: "Μαθηματικά: Γεωμετρία", hours: 2 },
        { name: "Φυσικές Επιστήμες: Φυσική", hours: 2 },
        { name: "Φυσικές Επιστήμες: Χημεία", hours: 2 },
        { name: "Φυσικές Επιστήμες: Βιολογία", hours: 2 },
        { name: "Εισαγωγή στις Αρχές της Επιστήμης των Η/Υ", hours: 2 },
        { name: "Ιστορία", hours: 2 },
        { name: "Φιλοσοφία", hours: 1 },
        { name: "Θρησκευτικά", hours: 1 },
        { name: "Αγγλικά", hours: 2 },
        { name: "Φυσική Αγωγή", hours: 1 }
      ],
      humanities: [
        { name: "Αρχαία Ελληνική Γλώσσα και Γραμματεία", hours: 3 },
        { name: "Λατινικά", hours: 2 }
      ],
      science: [
        { name: "Φυσική", hours: 2 },
        { name: "Μαθηματικά", hours: 3 }
      ],
      music_core: [
        { name: "Αρμονία", hours: 2 },
        { name: "Ανάπτυξη Ακουστικών Ικανοτήτων*", hours: 1 },
        { name: "Ελληνική Παραδοσιακή Μουσική", hours: 2 },
        { name: "Μορφολογία", hours: 1 },
        { name: "Ατομικό Όργανο Επιλογής", hours: 1 },
        { name: "Μουσικό Σύνολο (Οργανοχρησίας ή άλλου είδους)", hours: 2 },
        { name: "Μουσικό Σύνολο (Μουσικής Έκφρασης και Δημιουργίας)", hours: 2 },
      ],
    }
  },
  classC: {
    subjects: {
      core: [
        { name: "Θρησκευτικά", hours: 1 },
        { name: "Νεοελληνική Γλώσσα και Λογοτεχνία", hours: 6 },
        { name: "Ιστορία Γενικής Παιδείας* / Μαθηματικά Γενικής Παιδείας*", hours: 2 },
        { name: "Αγγλικά", hours: 1 },
        { name: "Φυσική Αγωγή", hours: 2 }
      ],
      humanities: [
        { name: "Αρχαία Ελληνικά", hours: 6 },
        { name: "Ιστορία", hours: 6 },
        { name: "Λατινικά", hours: 6 }
      ],
      science: [
        { name: "Μαθηματικά* / Βιολογία*", hours: 6 },
        { name: "Φυσική", hours: 6 },
        { name: "Χημεία", hours: 6 }
      ],
      economics: [
        { name: "Μαθηματικά", hours: 6 },
        { name: "Πληροφορική", hours: 6 },
        { name: "Οικονομία", hours: 6 }
      ],
      music_core: [
        { name: "Αρμονία", hours: 2 },
        { name: "Ανάπτυξη Ακουστικών Ικανοτήτων*", hours: 1 },
        { name: "Ελληνική Παραδοσιακή Μουσική", hours: 2 },
        { name: "Ατομικό Όργανο Επιλογής", hours: 1 },
        { name: "Μουσικό Σύνολο (Οργανοχρησίας ή άλλου είδους)", hours: 2 },
        { name: "Μουσικό Σύνολο (Μουσικής Έκφρασης και Δημιουργίας)", hours: 2 },
      ],
      music_optional: [
        { name: "Αρμονία (Ειδικό)", hours: 2 },
        { name: "Ανάπτυξη (Έλεγχος) Μουσικών Ακουστικών Ικανοτήτων", hours: 2 },
        { name: "Ελληνική Παραδοσιακή Μουσική", hours: 2 },
        { name: "Οργανολογία Μουσικών Οργάνων Συμφωνικής Ορχήστρας", hours: 2 },
        { name: "Οργανολογία Ελληνικών Παραδοσιακών Οργάνων", hours: 2 },
        { name: "Επεξεργασία Μουσικού Κειμένου με Η/Υ", hours: 2 },
        { name: "Ατομικό Όργανο Επιλογής ή και Αναφοράς (Πιάνο - Ταμπουράς ή άλλο", hours: 2 },
        { name: "Ανάλυση Παρτιτούρας Ορχήστρας", hours: 2 },
        { name: "Επεξεργασία Χορικού (Choral)", hours: 2 },
        { name: "Στοιχειώδεις αρχές ηχοληψίας ΙΙ", hours: 2 },
      ],
    }
  }
};

export const eaeLykeioData = {
  preliminary: {
    subjects: {
      core: [
        { name: "Νεοελληνική Γλώσσα και Γραμματεία", hours: 14 },
        { name: "Μαθηματικά", hours: 5 },
        { name: "Φυσική ", hours: 3 },
        { name: "Χημεία ", hours: 2 },
        { name: "Φυσική Αγωγή", hours: 2 },
        { name: "Καλλιτεχνική Παιδεία (Καλλιτεχνικά ή Μουσική ή θεατρική Παιδεία) ", hours: 2 },
        { name: "Υποστηρικτικές", hours: 4 },]
    }
  },
  classA: {
    subjects: {
      core: [
        { name: "Ελληνική Γλώσσα: Αρχαία Ελληνική Γλώσσα και Γραμματεία", hours: 4 },
        { name: "Ελληνική Γλώσσα: Νεοελληνική Γλώσσα και Λογοτεχνία", hours: 5 },
        { name: "Θρησκευτικά", hours: 2 },
        { name: "Ιστορία", hours: 2 },
        { name: "Μαθηματικά: Άλγεβρα", hours: 2 },
        { name: "Μαθηματικά: Γεωμετρία", hours: 2 },
        { name: "Αγγλικά", hours: 2 },
        { name: "2η Ξένη Γλώσσα*", hours: 1 },
        { name: "Φυσικές Επιστήμες: Φυσική", hours: 2 },
        { name: "Φυσικές Επιστήμες: Χημεία", hours: 2 },
        { name: "Φυσικές Επιστήμες: Βιολογία", hours: 2 },
        { name: "Φυσική Αγωγή", hours: 2 },
        { name: "Πολιτική Παιδεία", hours: 2 },
        { name: "Εφαρμογές Πληροφορικής", hours: 2 }
      ]
    }
  },
  classB: {
    subjects: {
      core: [
        { name: "Ελληνική Γλώσσα: Αρχαία Ελληνική Γλώσσα και Γραμματεία", hours: 2 },
        { name: "Ελληνική Γλώσσα: Νεοελληνική Γλώσσα και Λογοτεχνία", hours: 5 },
        { name: "Μαθηματικά: Άλγεβρα", hours: 2 },
        { name: "Μαθηματικά: Γεωμετρία", hours: 1 },
        { name: "Φυσικές Επιστήμες: Φυσική", hours: 2 },
        { name: "Φυσικές Επιστήμες: Χημεία", hours: 2 },
        { name: "Φυσικές Επιστήμες: Βιολογία", hours: 1 },
        { name: "Εισαγωγή στις Αρχές της Επιστήμης των Η/Υ", hours: 2 },
        { name: "Ιστορία", hours: 2 },
        { name: "Φιλοσοφία", hours: 1 },
        { name: "Θρησκευτικά", hours: 1 },
        { name: "Αγγλικά", hours: 2 },
        { name: "2η Ξένη Γλώσσα*", hours: 1 },
        { name: "Φυσική Αγωγή", hours: 3 }
      ],
      humanities: [
        { name: "Αρχαία Ελληνική Γλώσσα και Γραμματεία", hours: 3 },
        { name: "Λατινικά", hours: 2 }
      ],
      science: [
        { name: "Φυσική", hours: 2 },
        { name: "Μαθηματικά", hours: 3 }
      ]
    }
  },
  classC: {
    subjects: {
      core: [
        { name: "Θρησκευτικά", hours: 1 },
        { name: "Νεοελληνική Γλώσσα και Λογοτεχνία", hours: 6 },
        { name: "Ιστορία Γενικής Παιδείας* / Μαθηματικά Γενικής Παιδείας*", hours: 2 },
        { name: "Αγγλικά", hours: 2 },
        { name: "Φυσική Αγωγή", hours: 3 }
      ],
      humanities: [
        { name: "Αρχαία Ελληνικά", hours: 6 },
        { name: "Ιστορία", hours: 6 },
        { name: "Λατινικά", hours: 6 }
      ],
      science: [
        { name: "Μαθηματικά* / Βιολογία*", hours: 6 },
        { name: "Φυσική", hours: 6 },
        { name: "Χημεία", hours: 6 }
      ],
      economics: [
        { name: "Μαθηματικά", hours: 6 },
        { name: "Πληροφορική", hours: 6 },
        { name: "Οικονομία", hours: 6 }
      ]
    }
  }
};

export const eneegylLykeioData = {
  classA: {
    subjects: {
      core: [
        { name: "Ελληνική Γλώσσα: Αρχαία Ελληνική Γλώσσα και Γραμματεία", hours: 5 },
        { name: "Ελληνική Γλώσσα: Νεοελληνική Γλώσσα και Λογοτεχνία", hours: 4 },
        { name: "Θρησκευτικά", hours: 2 },
        { name: "Ιστορία", hours: 2 },
        { name: "Μαθηματικά: Άλγεβρα", hours: 3 },
        { name: "Μαθηματικά: Γεωμετρία", hours: 2 },
        { name: "Αγγλικά", hours: 3 },
        { name: "2η Ξένη Γλώσσα*", hours: 2 },
        { name: "Φυσικές Επιστήμες: Φυσική", hours: 2 },
        { name: "Φυσικές Επιστήμες: Χημεία", hours: 2 },
        { name: "Φυσικές Επιστήμες: Βιολογία", hours: 2 },
        { name: "Φυσική Αγωγή", hours: 2 },
        { name: "Πολιτική Παιδεία", hours: 2 },
        { name: "Εφαρμογές Πληροφορικής", hours: 2 }
      ]
    }
  },
  classB: {
    subjects: {
      core: [
        { name: "Ελληνική Γλώσσα: Αρχαία Ελληνική Γλώσσα και Γραμματεία", hours: 2 },
        { name: "Ελληνική Γλώσσα: Νεοελληνική Γλώσσα και Λογοτεχνία", hours: 4 },
        { name: "Μαθηματικά: Άλγεβρα", hours: 3 },
        { name: "Μαθηματικά: Γεωμετρία", hours: 2 },
        { name: "Φυσικές Επιστήμες: Φυσική", hours: 2 },
        { name: "Φυσικές Επιστήμες: Χημεία", hours: 2 },
        { name: "Φυσικές Επιστήμες: Βιολογία", hours: 2 },
        { name: "Εισαγωγή στις Αρχές της Επιστήμης των Η/Υ", hours: 2 },
        { name: "Ιστορία", hours: 2 },
        { name: "Φιλοσοφία", hours: 2 },
        { name: "Θρησκευτικά", hours: 2 },
        { name: "Αγγλικά", hours: 2 },
        { name: "2η Ξένη Γλώσσα*", hours: 1 },
        { name: "Φυσική Αγωγή", hours: 2 }
      ],
      humanities: [
        { name: "Αρχαία Ελληνική Γλώσσα και Γραμματεία", hours: 3 },
        { name: "Λατινικά", hours: 2 }
      ],
      science: [
        { name: "Φυσική", hours: 2 },
        { name: "Μαθηματικά", hours: 3 }
      ]
    }
  },
  classC: {
    subjects: {
      core: [
        { name: "Θρησκευτικά", hours: 1 },
        { name: "Νεοελληνική Γλώσσα και Λογοτεχνία", hours: 6 },
        { name: "Ιστορία Γενικής Παιδείας* / Μαθηματικά Γενικής Παιδείας*", hours: 2 },
        { name: "Αγγλικά", hours: 2 },
        { name: "Φυσική Αγωγή", hours: 3 }
      ],
      humanities: [
        { name: "Αρχαία Ελληνικά", hours: 6 },
        { name: "Ιστορία", hours: 6 },
        { name: "Λατινικά", hours: 6 }
      ],
      science: [
        { name: "Μαθηματικά* / Βιολογία*", hours: 6 },
        { name: "Φυσική", hours: 6 },
        { name: "Χημεία", hours: 6 }
      ],
      economics: [
        { name: "Μαθηματικά", hours: 6 },
        { name: "Πληροφορική", hours: 6 },
        { name: "Οικονομία", hours: 6 }
      ]
    }
  }
};