export const imerisioGymnasioData = {
    classA: {
        subjects: {
            core: [
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Γλωσσική Διδασκαλία", hours: 3 },
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Νεοελληνική Λογοτεχνία", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνική Γλώσσα", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνικά Κείμενα από Μετάφραση", hours: 2 },
                { name: "Μαθηματικά", hours: 4 },
                { name: "Φυσική", hours: 1 },
                { name: "Βιολογία", hours: 1 },
                { name: "Γεωλογία - Γεωγραφία", hours: 1 },
                { name: "Ιστορία", hours: 2 },
                { name: "Θρησκευτικά", hours: 2 },
                { name: "Αγγλικά", hours: 2 },
                { name: "2η Ξένη Γλώσσα*", hours: 2 },
                { name: "Οικιακή Οικονομία", hours: 1 },
                { name: "Φυσική Αγωγή", hours: 2 },
                { name: "Τεχνολογία & Πληροφορική: Τεχνολογία", hours: 1 },
                { name: "Τεχνολογία & Πληροφορική: Πληροφορική", hours: 2 },
                { name: "Πολιτισμός & Δραστηριότητες: Μουσική", hours: 1 },
                { name: "Πολιτισμός & Δραστηριότητες: Καλλιτεχνικά", hours: 1 },
                { name: "Εργαστήριο Δεξιοτήτων", hours: 1 }
            ]
        }
    },

    classB: {
        subjects: {
            core: [
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Γλωσσική Διδασκαλία", hours: 2 },
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Νεοελληνική Λογοτεχνία", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνική Γλώσσα", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνικά Κείμενα από Μετάφραση", hours: 2 },
                { name: "Μαθηματικά", hours: 4 },
                { name: "Φυσική", hours: 2 },
                { name: "Χημεία", hours: 1 },
                { name: "Βιολογία", hours: 1 },
                { name: "Γεωλογία - Γεωγραφία", hours: 2 },
                { name: "Ιστορία", hours: 2 },
                { name: "Θρησκευτικά", hours: 2 },
                { name: "Αγγλικά", hours: 2 },
                { name: "2η Ξένη Γλώσσα*", hours: 2 },
                { name: "Φυσική Αγωγή", hours: 2 },
                { name: "Τεχνολογία & Πληροφορική: Τεχνολογία", hours: 1 },
                { name: "Τεχνολογία & Πληροφορική: Πληροφορική", hours: 1 },
                { name: "Πολιτισμός & Δραστηριότητες: Μουσική", hours: 1 },
                { name: "Πολιτισμός & Δραστηριότητες: Καλλιτεχνικά", hours: 1 },
                { name: "Εργαστήριο Δεξιοτήτων", hours: 1 }
            ]
        }
    },
    classC: {
        subjects: {
            core: [
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Γλωσσική Διδασκαλία", hours: 2 },
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Νεοελληνική Λογοτεχνία", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνική Γλώσσα", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνικά Κείμενα από Μετάφραση", hours: 2 },
                { name: "Μαθηματικά", hours: 4 },
                { name: "Φυσική", hours: 2 },
                { name: "Χημεία", hours: 1 },
                { name: "Βιολογία", hours: 1 },
                { name: "Ιστορία", hours: 2 },
                { name: "Θρησκευτικά", hours: 2 },
                { name: "Αγγλικά", hours: 2 },
                { name: "2η Ξένη Γλώσσα*", hours: 2 },
                { name: "Κοινωνική και Πολιτική Αγωγή", hours: 3 },
                { name: "Φυσική Αγωγή", hours: 2 },
                { name: "Τεχνολογία & Πληροφορική: Τεχνολογία", hours: 1 },
                { name: "Τεχνολογία & Πληροφορική: Πληροφορική", hours: 1 },
                { name: "Πολιτισμός & Δραστηριότητες: Μουσική", hours: 1 },
                { name: "Πολιτισμός & Δραστηριότητες: Καλλιτεχνικά", hours: 1 },
                { name: "Εργαστήριο Δεξιοτήτων", hours: 1 }
            ]
        }
    },
};


export const esperinoGymnasioData = {
    classA: {
        subjects: {
            core: [
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Γλωσσική Διδασκαλία", hours: 3 },
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Νεοελληνική Λογοτεχνία", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνική Γλώσσα", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνικά Κείμενα από Μετάφραση", hours: 2 },
                { name: "Μαθηματικά", hours: 4 },
                { name: "Φυσική", hours: 1 },
                { name: "Βιολογία", hours: 1 },
                { name: "Γεωλογία - Γεωγραφία", hours: 2 },
                { name: "Ιστορία", hours: 2 },
                { name: "Θρησκευτικά", hours: 1 },
                { name: "Αγγλικά", hours: 2 },
                { name: "Πληροφορική", hours: 1 },
                { name: "Εργαστήριο Δεξιοτήτων", hours: 1 }
            ]
        }
    },
    classB: {
        subjects: {
            core: [
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Γλωσσική Διδασκαλία", hours: 3 },
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Νεοελληνική Λογοτεχνία", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνική Γλώσσα", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνικά Κείμενα από Μετάφραση", hours: 2 },
                { name: "Μαθηματικά", hours: 4 },
                { name: "Φυσική", hours: 1 },
                { name: "Χημεία", hours: 1 },
                { name: "Βιολογία", hours: 1 },
                { name: "Γεωλογία - Γεωγραφία", hours: 1 },
                { name: "Ιστορία", hours: 2 },
                { name: "Θρησκευτικά", hours: 1 },
                { name: "Αγγλικά", hours: 2 },
                { name: "Πληροφορική", hours: 1 },
                { name: "Εργαστήριο Δεξιοτήτων", hours: 1 }
            ]
        }
    },
    classC: {
        subjects: {
            core: [
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Γλωσσική Διδασκαλία", hours: 2 },
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Νεοελληνική Λογοτεχνία", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνική Γλώσσα", hours: 1 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνικά Κείμενα από Μετάφραση", hours: 2 },
                { name: "Μαθηματικά", hours: 4 },
                { name: "Φυσική", hours: 2 },
                { name: "Χημεία", hours: 1 },
                { name: "Βιολογία", hours: 1 },
                { name: "Ιστορία", hours: 2 },
                { name: "Κοινωνική και Πολιτική Αγωγή", hours: 3 },
                { name: "Θρησκευτικά", hours: 1 },
                { name: "Αγγλικά", hours: 2 },
                { name: "Πληροφορική", hours: 1 },
                { name: "Εργαστήριο Δεξιοτήτων", hours: 1 }
            ]
        }
    }
};

export const kallitexnikoGymnasioData = {
    classA: {
        subjects: {
            core: [
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Γλωσσική Διδασκαλία", hours: 3 },
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Νεοελληνική Λογοτεχνία", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνική Γλώσσα", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνικά Κείμενα από Μετάφραση", hours: 2 },
                { name: "Μαθηματικά", hours: 4 },
                { name: "Φυσική", hours: 1 },
                { name: "Βιολογία", hours: 1 },
                { name: "Γεωλογία - Γεωγραφία", hours: 1 },
                { name: "Ιστορία", hours: 2 },
                { name: "Θρησκευτικά", hours: 1 },
                { name: "Αγγλικά", hours: 2 },
                { name: "Γαλλικά/Γερμανικά", hours: 2 },
                { name: "Φυσική Αγωγή", hours: 2 },
                { name: "Πληροφορική", hours: 1 },
            ],
            art: [
                { name: "Εικαστικό εργαστήρι", hours: 8 },
                { name: "Ιστορία Τέχνης", hours: 2 },
                { name: "Χορός", hours: 1 },
                { name: "Θέατρο", hours: 2 },
                { name: "Μουσική", hours: 1 },
            ],
            theatre: [
                { name: "Υποκριτική - Αυτοσχεδιασμός", hours: 4 },
                { name: "Αγωγή Προφορικού Λόγου", hours: 1 },
                { name: "Θεατρολογία", hours: 1 },
                { name: "Θεατρική Κίνηση - Χορός", hours: 1 },
                { name: "Κινηματογράφος", hours: 3 },
                { name: "Εικαστικά", hours: 1 },
                { name: "Μουσική", hours: 1 },
                { name: "Εργαστήρι Δημιουργικής Γραφής", hours: 2 },
            ],
            dance: [
                { name: "Κλασικός Χορός", hours: 4 },
                { name: "Σύγχρονος Χορός", hours: 4 },
                { name: "Παραδοσιακός Χορός", hours: 2 },
                { name: "Μουσική", hours: 2 },
                { name: "Θέατρο", hours: 1 },
                { name: "Εικαστικά", hours: 1 },
            ],
        }
    },

    classB: {
        subjects: {
            core: [
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Γλωσσική Διδασκαλία", hours: 2 },
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Νεοελληνική Λογοτεχνία", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνική Γλώσσα", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνικά Κείμενα από Μετάφραση", hours: 2 },
                { name: "Μαθηματικά", hours: 4 },
                { name: "Φυσική", hours: 2 },
                { name: "Χημεία", hours: 1 },
                { name: "Βιολογία", hours: 1 },
                { name: "Γεωλογία - Γεωγραφία", hours: 1 },
                { name: "Ιστορία", hours: 2 },
                { name: "Θρησκευτικά", hours: 1 },
                { name: "Αγγλικά", hours: 2 },
                { name: "Γαλλικά/Γερμανικά", hours: 2 },
                { name: "Φυσική Αγωγή", hours: 1 },
                { name: "Πληροφορική", hours: 1 },
            ],
            art: [
                { name: "Εικαστικό εργαστήρι", hours: 9 },
                { name: "Ιστορία Τέχνης", hours: 2 },
                { name: "Χορός", hours: 1 },
                { name: "Θέατρο", hours: 1 },
                { name: "Μουσική", hours: 1 },
            ],
            theatre: [
                { name: "Υποκριτική", hours: 3 },
                { name: "Αγωγή Προφορικού Λόγου", hours: 1 },
                { name: "Θεατρολογία", hours: 1 },
                { name: "Θεατρική Κίνηση - Χορός", hours: 2 },
                { name: "Κινηματογράφος", hours: 3 },
                { name: "Εικαστικά", hours: 1 },
                { name: "Μουσική", hours: 1 },
                { name: "Εργαστήρι Δημιουργικής Γραφής", hours: 2 },
            ],
            dance: [
                { name: "Κλασικός Χορός", hours: 4 },
                { name: "Σύγχρονος Χορός", hours: 4 },
                { name: "Παραδοσιακός Χορός", hours: 2 },
                { name: "Μουσική", hours: 2 },
                { name: "Θέατρο", hours: 1 },
                { name: "Εικαστικά", hours: 1 },
            ],
        }
    },
    classC: {
        subjects: {
            core: [
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Γλωσσική Διδασκαλία", hours: 2 },
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Νεοελληνική Λογοτεχνία", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνική Γλώσσα", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνικά Κείμενα από Μετάφραση", hours: 2 },
                { name: "Μαθηματικά", hours: 4 },
                { name: "Φυσική", hours: 2 },
                { name: "Χημεία", hours: 1 },
                { name: "Βιολογία", hours: 1 },
                { name: "Ιστορία", hours: 2 },
                { name: "Κοινωνική και πολιτική Αγωγή", hours: 1 },
                { name: "Θρησκευτικά", hours: 1 },
                { name: "Αγγλικά", hours: 2 },
                { name: "Γαλλικά/Γερμανικά", hours: 2 },
                { name: "Φυσική Αγωγή", hours: 2 },
                { name: "Πληροφορική", hours: 1 },
            ],
            art: [
                { name: "Εικαστικό εργαστήρι", hours: 8 },
                { name: "Ιστορία Τέχνης", hours: 2 },
                { name: "Χορός", hours: 1 },
                { name: "Θέατρο", hours: 1 },
                { name: "Μουσική", hours: 1 },
            ],
            theatre: [
                { name: "Υποκριτική - Αυτοσχεδιασμός", hours: 3 },
                { name: "Αγωγή Προφορικού Λόγου", hours: 1 },
                { name: "Θεατρολογία", hours: 1 },
                { name: "Θεατρική Κίνηση - Χορός", hours: 1 },
                { name: "Κινηματογράφος", hours: 3 },
                { name: "Εικαστικά", hours: 1 },
                { name: "Μουσική", hours: 1 },
                { name: "Εργαστήρι Δημιουργικής Γραφής", hours: 2 },
            ],
            dance: [
                { name: "Κλασικός Χορός", hours: 3 },
                { name: "Σύγχρονος Χορός", hours: 4 },
                { name: "Παραδοσιακός Χορός", hours: 2 },
                { name: "Μουσική", hours: 2 },
                { name: "Θέατρο", hours: 1 },
                { name: "Εικαστικά", hours: 1 },
            ],
        }
    },
};


export const mousikoGymnasioData = {
    classA: {
        subjects: {
            core: [
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Γλωσσική Διδασκαλία", hours: 3 },
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Νεοελληνική Λογοτεχνία", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνική Γλώσσα", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνικά Κείμενα από Μετάφραση", hours: 2 },
                { name: "Μαθηματικά", hours: 4 },
                { name: "Φυσική", hours: 1 },
                { name: "Βιολογία", hours: 1 },
                { name: "Γεωλογία - Γεωγραφία", hours: 1 },
                { name: "Ιστορία", hours: 2 },
                { name: "Θρησκευτικά", hours: 1 },
                { name: "Αγγλικά", hours: 2 },
                { name: "Γαλλικά/Γερμανικά", hours: 2 },
                { name: "Φυσική Αγωγή*", hours: 2 },
                { name: "Πληροφορική", hours: 1 },
                { name: "Αισθητική Αγωγή: Θέατρο", hours: 1 },
                { name: "Αισθητική Αγωγή: Καλλιτεχνικά", hours: 1 },
                { name: "Αισθητική Αγωγή: Ιστορία Τέχνης", hours: 1 }
            ],
            music: [
                { name: "Ευρωπαϊκή Μουσική (Θεωρία και Πράξη)", hours: 2 },
                { name: "Ελληνική Παραδοσιακή Μουσική (Θεωρία και Πράξη)", hours: 2 },
                { name: "Κριτική Μουσική Ακρόαση", hours: 1 },
                { name: "Χορωδία*", hours: 2 },
                { name: "Μουσικό Σύνολο (Οργανοχρησίας ή άλλου είδους)", hours: 2 },
                { name: "Πιάνο", hours: 1 },
                { name: "Ταμπουράς ή άλλο τοπικό παραδοσιακό όργανο αναφοράς", hours: 1 },
                { name: "Ατομικό Όργανο Επιλογής", hours: 2 },
            ]
        }
    },

    classB: {
        subjects: {
            core: [
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Γλωσσική Διδασκαλία", hours: 2 },
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Νεοελληνική Λογοτεχνία", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνική Γλώσσα", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνικά Κείμενα από Μετάφραση", hours: 2 },
                { name: "Μαθηματικά", hours: 4 },
                { name: "Φυσική", hours: 2 },
                { name: "Χημεία", hours: 1 },
                { name: "Βιολογία", hours: 1 },
                { name: "Γεωλογία - Γεωγραφία", hours: 1 },
                { name: "Ιστορία", hours: 2 },
                { name: "Θρησκευτικά", hours: 1 },
                { name: "Αγγλικά", hours: 2 },
                { name: "Γαλλικά/Γερμανικά", hours: 2 },
                { name: "Φυσική Αγωγή*", hours: 2 },
                { name: "Πληροφορική", hours: 1 },
                { name: "Αισθητική Αγωγή: Θέατρο", hours: 1 },
                { name: "Αισθητική Αγωγή: Καλλιτεχνικά", hours: 1 },
            ],
            music: [
                { name: "Ευρωπαϊκή Μουσική (Θεωρία και Πράξη)", hours: 2 },
                { name: "Ελληνική Παραδοσιακή Μουσική (Θεωρία και Πράξη)", hours: 2 },
                { name: "Ιστορία Μουσικής", hours: 1 },
                { name: "Χορωδία*", hours: 2 },
                { name: "Μουσικό Σύνολο (Οργανοχρησίας ή άλλου είδους)", hours: 2 },
                { name: "Πιάνο", hours: 1 },
                { name: "Ταμπουράς ή άλλο τοπικό παραδοσιακό όργανο αναφοράς", hours: 1 },
                { name: "Ατομικό Όργανο Επιλογής", hours: 2 },
            ]
        }
    },
    classC: {
        subjects: {
            core: [
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Γλωσσική Διδασκαλία", hours: 2 },
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Νεοελληνική Λογοτεχνία", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνική Γλώσσα", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνικά Κείμενα από Μετάφραση", hours: 2 },
                { name: "Μαθηματικά", hours: 4 },
                { name: "Φυσική", hours: 2 },
                { name: "Χημεία", hours: 1 },
                { name: "Βιολογία", hours: 1 },
                { name: "Ιστορία", hours: 2 },
                { name: "Κοινωνική και πολιτική Αγωγή", hours: 1 },
                { name: "Θρησκευτικά", hours: 1 },
                { name: "Αγγλικά", hours: 2 },
                { name: "Γαλλικά/Γερμανικά", hours: 2 },
                { name: "Φυσική Αγωγή", hours: 1 },
                { name: "Πληροφορική", hours: 1 },
                { name: "Αισθητική Αγωγή: Θέατρο", hours: 1 },
                { name: "Αισθητική Αγωγή: Καλλιτεχνικά", hours: 1 },],
            music: [
                { name: "Ευρωπαϊκή Μουσική (Θεωρία και Πράξη και Εισαγωγή στην Αρμονία)", hours: 3 },
                { name: "Ελληνική Παραδοσιακή Μουσική (Θεωρία και Πράξη)", hours: 2 },
                { name: "Ιστορία Μουσικής", hours: 1 },
                { name: "Χορωδία*", hours: 2 },
                { name: "Μουσικό Σύνολο (Οργανοχρησίας ή άλλου είδους)", hours: 2 },
                { name: "Πιάνο", hours: 1 },
                { name: "Ταμπουράς ή άλλο τοπικό παραδοσιακό όργανο αναφοράς", hours: 1 },
                { name: "Ατομικό Όργανο Επιλογής", hours: 2 },
            ]
        }
    },
};


export const eneegylGymnasioData = {
    classA: {
        subjects: {
            core: [
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Γλωσσική Διδασκαλία", hours: 3 },
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Νεοελληνική Λογοτεχνία", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνικά Κείμενα από Μετάφραση", hours: 2 },
                { name: "Μαθηματικά", hours: 3 },
                { name: "Φυσική", hours: 1 },
                { name: "Βιολογία", hours: 1 },
                { name: "Γεωλογία - Γεωγραφία", hours: 1 },
                { name: "Ιστορία", hours: 2 },
                { name: "Θρησκευτικά", hours: 2 },
                { name: "Αγγλικά", hours: 1 },
                { name: "Οικιακή Οικονομία", hours: 2 },
                { name: "Φυσική Αγωγή", hours: 2 },
                { name: "Τεχνολογία & Πληροφορική: Τεχνολογία", hours: 1 },
                { name: "Τεχνολογία & Πληροφορική: Πληροφορική", hours: 1 },
                { name: "Πολιτισμός & Δραστηριότητες: Μουσική / Θεατρική Αγωγή", hours: 1 },
                { name: "Πολιτισμός & Δραστηριότητες: Καλλιτεχνικά", hours: 1 },
                { name: "Σχολικός Επαγγελματικός Προσανατολισμός", hours: 2, hoursBreakdown: "1Θ + 1Ε" },
                { name: "Ζώνη Δημιουργικών Δραστηριοτήτων", hours: 2 },
                { name: "Εργαστήριο Δεξιοτήτων", hours: 1 },
            ]
        }
    },

    classB: {
        subjects: {
            core: [
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Γλωσσική Διδασκαλία", hours: 2 },
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Νεοελληνική Λογοτεχνία", hours: 1 },
                { name: "Αρχαία Ελληνικά Κείμενα από Μετάφραση", hours: 2 },
                { name: "Μαθηματικά", hours: 3 },
                { name: "Φυσική", hours: 1 },
                { name: "Χημεία", hours: 1 },
                { name: "Βιολογία", hours: 1 },
                { name: "Γεωλογία - Γεωγραφία", hours: 1 },
                { name: "Ιστορία", hours: 2 },
                { name: "Θρησκευτικά", hours: 2 },
                { name: "Αγγλικά", hours: 1 },
                { name: "Φυσική Αγωγή", hours: 2 },
                { name: "Τεχνολογία & Πληροφορική: Τεχνολογία", hours: 2 },
                { name: "Τεχνολογία & Πληροφορική: Πληροφορική", hours: 2 },
                { name: "Πολιτισμός & Δραστηριότητες: Μουσική / Θεατρική Αγωγή", hours: 1 },
                { name: "Πολιτισμός & Δραστηριότητες: Καλλιτεχνικά", hours: 1 },
                { name: "Σχολικός Επαγγελματικός Προσανατολισμός", hours: 3, hoursBreakdown: "1Θ + 2Ε" },
                { name: "Ζώνη Δημιουργικών Δραστηριοτήτων", hours: 2 },
                { name: "Εργαστήριο Δεξιοτήτων", hours: 1 },
            ]
        }
    },
    classC: {
        subjects: {
            core: [
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Γλωσσική Διδασκαλία", hours: 2 },
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Νεοελληνική Λογοτεχνία", hours: 1 },
                { name: "Αρχαία Ελληνικά Κείμενα από Μετάφραση", hours: 2 },
                { name: "Μαθηματικά", hours: 3 },
                { name: "Φυσική", hours: 2 },
                { name: "Γεωλογία - Γεωγραφία", hours: 1 },
                { name: "Ιστορία", hours: 1 },
                { name: "Θρησκευτικά", hours: 1 },
                { name: "Αγγλικά", hours: 1 },
                { name: "Κοινωνική και Πολιτική Αγωγή", hours: 1 },
                { name: "Φυσική Αγωγή", hours: 2 },
                { name: "Τεχνολογία & Πληροφορική: Τεχνολογία", hours: 2 },
                { name: "Τεχνολογία & Πληροφορική: Πληροφορική", hours: 2 },
                { name: "Πολιτισμός & Δραστηριότητες: Μουσική / Θεατρική Αγωγή", hours: 1 },
                { name: "Πολιτισμός & Δραστηριότητες: Καλλιτεχνικά", hours: 1 },
                { name: "Σχολικός Επαγγελματικός Προσανατολισμός", hours: 5, hoursBreakdown: "1Θ + 4Ε" },
                { name: "Ζώνη Δημιουργικών Δραστηριοτήτων", hours: 2 },
                { name: "Εργαστήριο Δεξιοτήτων", hours: 1 },
            ]
        }
    },
    classD: {
        subjects: {
            core: [
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Γλωσσική Διδασκαλία", hours: 2 },
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Νεοελληνική Λογοτεχνία", hours: 1 },
                { name: "Αρχαία Ελληνικά Κείμενα από Μετάφραση", hours: 2 },
                { name: "Μαθηματικά", hours: 3 },
                { name: "Φυσική", hours: 1 },
                { name: "Χημεία", hours: 1 },
                { name: "Βιολογία", hours: 1 },
                { name: "Ιστορία", hours: 1 },
                { name: "Θρησκευτικά", hours: 1 },
                { name: "Αγγλικά", hours: 1 },
                { name: "Φυσική Αγωγή", hours: 2 },
                { name: "Κοινωνική και Πολιτική Αγωγή", hours: 2 },
                { name: "Τεχνολογία & Πληροφορική: Τεχνολογία", hours: 2 },
                { name: "Τεχνολογία & Πληροφορική: Πληροφορική", hours: 2 },
                { name: "Πολιτισμός & Δραστηριότητες: Μουσική / Θεατρική Αγωγή", hours: 1 },
                { name: "Πολιτισμός & Δραστηριότητες: Καλλιτεχνικά", hours: 1 },
                { name: "Σχολικός Επαγγελματικός Προσανατολισμός", hours: 5, hoursBreakdown: "1Θ + 4Ε" },
                { name: "Ζώνη Δημιουργικών Δραστηριοτήτων", hours: 1 },
                { name: "Εργαστήριο Δεξιοτήτων", hours: 1 },
            ]
        }
    }
};

export const eaeGymnasioData = {
    preliminary: {
        subjects: {
            core: [
                { name: "Νέα Γλώσσα και Γραμματεία", hours: 15 },
                { name: "Μαθηματικά", hours: 5 },
                { name: "Νοηματική Γλώσσα για κωφούς και βαρήκοους ή εναλλακτικές μορφές επικοινωνίας για τους κινητικά ανάπηρους μαθητές μέσω Η/Υ ", hours: 4 },
                { name: "Φυσική Αγωγή", hours: 2 },
                { name: "Καλλιτεχνική Παιδεία (Καλλιτεχνικά ή Μουσική ή θεατρική Παιδεία) ", hours: 2 },
                { name: "Υποστηρικτικές", hours: 4 },
                { name: "Εργαστήριο Δεξιοτήτων", hours: 1 }
            ]
        }
    },
    classA: {
        subjects: {
            core: [
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Γλωσσική Διδασκαλία", hours: 4 },
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Νεοελληνική Λογοτεχνία", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνική Γλώσσα", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνικά Κείμενα από Μετάφραση", hours: 2 },
                { name: "Μαθηματικά", hours: 4 },
                { name: "Φυσική", hours: 1 },
                { name: "Βιολογία", hours: 1 },
                { name: "Γεωλογία - Γεωγραφία", hours: 1 },
                { name: "Ιστορία", hours: 2 },
                { name: "Θρησκευτικά", hours: 2 },
                { name: "Αγγλικά", hours: 2 },
                { name: "Οικιακή Οικονομία", hours: 2 },
                { name: "Φυσική Αγωγή", hours: 2 },
                { name: "Τεχνολογία & Πληροφορική: Τεχνολογία", hours: 1 },
                { name: "Τεχνολογία & Πληροφορική: Πληροφορική", hours: 2 },
                { name: "Πολιτισμός & Δραστηριότητες: Μουσική", hours: 1 },
                { name: "Πολιτισμός & Δραστηριότητες: Καλλιτεχνικά", hours: 1 },
                { name: "Εργαστήριο Δεξιοτήτων", hours: 1 }
            ]
        }
    },
    classB: {
        subjects: {
            core: [
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Γλωσσική Διδασκαλία", hours: 4 },
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Νεοελληνική Λογοτεχνία", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνική Γλώσσα", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνικά Κείμενα από Μετάφραση", hours: 2 },
                { name: "Μαθηματικά", hours: 4 },
                { name: "Φυσική", hours: 2 },
                { name: "Χημεία", hours: 1 },
                { name: "Βιολογία", hours: 1 },
                { name: "Γεωλογία - Γεωγραφία", hours: 2 },
                { name: "Ιστορία", hours: 2 },
                { name: "Θρησκευτικά", hours: 2 },
                { name: "Αγγλικά", hours: 2 },
                { name: "Φυσική Αγωγή", hours: 2 },
                { name: "Τεχνολογία & Πληροφορική: Τεχνολογία", hours: 1 },
                { name: "Τεχνολογία & Πληροφορική: Πληροφορική", hours: 1 },
                { name: "Πολιτισμός & Δραστηριότητες: Μουσική", hours: 1 },
                { name: "Πολιτισμός & Δραστηριότητες: Καλλιτεχνικά", hours: 1 },
                { name: "Πολιτισμός & Δραστηριότητες: Εργαστήριο Δεξιοτήτων", hours: 1 }
            ]
        }
    },
    classC: {
        subjects: {
            core: [
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Γλωσσική Διδασκαλία", hours: 4 },
                { name: "Νεοελληνική Γλώσσα & Γραμματεία: Νεοελληνική Λογοτεχνία", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνική Γλώσσα", hours: 2 },
                { name: "Αρχαία Ελληνική Γλώσσα & Γραμματεία: Αρχαία Ελληνικά Κείμενα από Μετάφραση", hours: 2 },
                { name: "Μαθηματικά", hours: 4 },
                { name: "Φυσική", hours: 2 },
                { name: "Χημεία", hours: 1 },
                { name: "Βιολογία", hours: 1 },
                { name: "Ιστορία", hours: 2 },
                { name: "Θρησκευτικά", hours: 2 },
                { name: "Αγγλικά", hours: 2 },
                { name: "Κοινωνική και Πολιτική Αγωγή", hours: 3 },
                { name: "Φυσική Αγωγή", hours: 2 },
                { name: "Τεχνολογία & Πληροφορική: Τεχνολογία", hours: 1 },
                { name: "Τεχνολογία & Πληροφορική: Πληροφορική", hours: 1 },
                { name: "Πολιτισμός & Δραστηριότητες: Μουσική", hours: 1 },
                { name: "Πολιτισμός & Δραστηριότητες: Καλλιτεχνικά", hours: 1 },
                { name: "Πολιτισμός & Δραστηριότητες: Εργαστήριο Δεξιοτήτων", hours: 1 }
            ]
        }
    },
};


